Tekla.Structures.Model.Collaboration.ParametricObject_ObjectBoundingBox
The ParametricObject_ObjectBoundingBox class contains the object bounding box (OBB) definition.

Tekla.Structures.Model.Collaboration.ParametricObject_ObjectBoundingBox.yDir
The Y direction.